#include <iostream>
#include<snake.h>
#include<map_snake.h>
#include<conio.h>
#include<windows.h>
/*
    简单贪吃蛇游戏
    目前发现BUG有：
                1.由于apple被吃后才开始取下一个apple位置，算法问题，会出现卡顿
                2.疑似BUG的一个情况是，snake吃了apple后，apple可能出现在蛇身上（可能由于我蛇的位置更新不及时）






*/

using namespace std;

int main()
{

     char map_arr[14][14]={'*','*','*','*','*','*','*','*','*','*','*','*','*','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',
                      '*','*','*','*','*','*','*','*','*','*','*','*','*','*'
                        };



    map_snake *_map=new map_snake(map_arr,2,2);//new一个地图对象
    _map->showmap();//初始化显示地图
    _map->_apple->draw_apple();//必须提前一个画出apple
    char fangxiang;
    fangxiang=_getch();
    while(_map->game_flat){


        if(_kbhit()){
        //_kbhit()非堵塞式函数，代替多线程
            fangxiang=_getch();
        }
        _map->sn->move_to(fangxiang);
        Sleep(_map->speed);

    }



}
